AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/PeriodicBoundaryAndMeanVelocityForce/case/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(
    {
        name constraint;
        patchInfo
        {
            type symmetry;
        }
        constructFrom patches;
        patches ( "patch_1_.*" );
    }
    {
        name wall;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches ( "patch_4_.*" );
    }
    {
        name defaultFaces;
        patchInfo
        {
            type patch;
        }
        constructFrom patches;
        patches ( "patch_0_0" );
    }

    {
        name constraint001_master;
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch constraint001_slave;

            transform translational;
            separationVector ( 0.014 0.0 0.0 );
        }

        constructFrom patches;
        patches ( "patch_2_.*" );
    }
    {
        name constraint001_slave;
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch constraint001_master;

            transform translational;
            separationVector ( 0.014 0.0 0.0 );
        }

        constructFrom patches;
        patches ( "patch_3_.*" );
    }
);


// ************************************************************************* //
