AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/PeriodicBoundaryAndMeanVelocityForce/case/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#includeIfPresent "fvOptionsScalarTransport"

momentumSource
{
    type            meanVelocityForce;
    selectionMode   all;
    active          yes;
    meanVelocityForceCoeffs
    {
        selectionMode   all;
        fields          (U);
        direction       (1.0 0.0 0.0);
        Ubar            (0.005 0.0 0.0);
        relaxation      0.2;
    }
}

//************************************************************************ //
